@themantissa @thetonymaster 
I already did a manual test for the network peering

I created a simple network peering resource, after that I only change the `vpc_id` to another (an existing vpc_id of course) and the network peer was recreated as expected

(I changed some text in this log to preserve sensitive data)

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # mongodbatlas_network_peering.test must be replaced
-/+ resource "mongodbatlas_network_peering" "test" {
      + atlas_cidr_block       = (known after apply)
      + atlas_gcp_project_id   = (known after apply)
      ~ atlas_id               = "------------" -> (known after apply)
      + atlas_vpc_name         = (known after apply)
      + azure_directory_id     = (known after apply)
      + azure_subscription_id  = (known after apply)
      ~ connection_id          = "-------------------" -> (known after apply)
      + error_message          = (known after apply)
      + error_state            = (known after apply)
      + error_state_name       = (known after apply)
      + gcp_project_id         = (known after apply)
      ~ id                     = "-----------" -> (known after apply)
      + network_name           = (known after apply)
      ~ peer_id                = "------------------" -> (known after apply)
      + resource_group_name    = (known after apply)
      + status                 = (known after apply)
      ~ status_name            = "PENDING_ACCEPTANCE" -> (known after apply)
      + vnet_name              = (known after apply)
      ~ vpc_id                 = "vpc---------9" -> "vpc-----------c" # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

mongodbatlas_network_peering.test: Destroying... [---------]
mongodbatlas_network_peering.test: Still destroying... [id=-----------, 10s elapsed]
mongodbatlas_network_peering.test: Destruction complete after 11s
mongodbatlas_network_peering.test: Creating...
mongodbatlas_network_peering.test: Still creating... [10s elapsed]
mongodbatlas_network_peering.test: Still creating... [20s elapsed]
mongodbatlas_network_peering.test: Still creating... [30s elapsed]
mongodbatlas_network_peering.test: Still creating... [40s elapsed]
mongodbatlas_network_peering.test: Creation complete after 41s [id=----------]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```